CI4.3-Herry/app/Controllers/Ctr/BackendPage.php

    public function index()
    {
        $db = \Config\Database::connect();

        $pager = service('pager');
        // 設置基礎路徑
        $pager->setPath('/Herry/CI4.3-Herry/BackendPage');


        // 產品分頁
        // 當前頁碼，使用getGet('page_products')分組
        $product_page = (int) ($this->request->getGet('page') ?? 1);
        // 每頁顯示的資料筆數
        $perPage = 5;
        // 計算偏移量
        $offset = ($product_page - 1) * $perPage;
        // 總資料筆數
        $products_total = $db->table('products')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `products`