CI4.3-Herry/app/Controllers/Ctr/TEST.php

SELECT `admindata`.*
FROM `admindata`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('admindata');
        $builder->select('admindata.*');
        $query = $builder->get();

SELECT `memberdata`.*
FROM `memberdata`
---
    public function member()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('memberdata');
        $builder->select('memberdata.*');
        $query = $builder->get();