CI4.3-Herry/app/Controllers/Ctr/UpdateProduct.php

SELECT *
FROM `products`
WHERE `sID` = '155'
SELECT `subcategory`.*, `category`.`categoryName`
FROM `subcategory`
JOIN `category` ON `subcategory`.`categoryID` = `category`.`categoryID`
---
    public function index($sId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('products');
        $builder->where('sID', $sId);
        $query = $builder->get();
        $data=[];
        foreach($query->getResultArray() as $row){
            $data['sID'] = $row['sID'];
            $data['categoryID'] = $row['categoryID'];
            $data['subcategoryID'] = $row['subcategoryID'];
            $data['sSort'] = $row['sSort'];
            $data['sIMG'] = $row['sIMG'];
            $data['sName'] = $row['sName'];
            $data['sOri_Price'] = $row['sOri_Price'];
            $data['sDiscount'] = $row['sDiscount'];
            $data['sNarrate'] = $row['sNarrate'];
            $data['sContent1'] = $row['sContent1'];
            $data['sContent2'] = $row['sContent2'];
            $data['sContent3'] = $row['sContent3'];
        }
        $builder = $db->table('subcategory');
        $builder->select('subcategory.*, category.categoryName');
        $builder->join('category', 'subcategory.categoryID = category.categoryID');
        $query = $builder->get();