CI4_home/app/Controllers/Login.php

    public function receive()
    {

        if ($_POST) {

            $username = $_POST['username'];

            $db = \Config\Database::connect();
            $builder = $db->table('memberdata');
            $builder->select('m_username');
            $builder->where('m_username',$username);
            $query = $builder->get();
---
SELECT `m_username`
FROM `memberdata`
WHERE `m_username` = 'member3'