CI4_home/app/Controllers/Products.php

    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('subcategory');
        $builder->select('*,category.categoryName');
        $builder->join('category', 'category.categoryID = subcategory.categoryID');
        $query = $builder->get();
---
SELECT *, `category`.`categoryName`
FROM `subcategory`
JOIN `category` ON `category`.`categoryID` = `subcategory`.`categoryID`