CI4.3-Herry/app/Services/DatabaseService.php

        public function getProducts($perPage,$offset)
        {
            $builder = $this->db->table('products');
            $builder->select('*');
            $builder->orderBy('sSort', 'ASC');
            $query = $builder->get($perPage,$offset);
---
SELECT *
FROM `products`
ORDER BY `sSort` ASC
 LIMIT 9
SELECT COUNT(*) AS `numrows` FROM `products`

        public function getSubCategory()
        {
            $builder = $this->db->table('subcategory');
            $builder->select('*');
            $builder->orderBy('subcategoryID', 'ASC');
            $query = $builder->get();
---
SELECT *
FROM `subcategory`
ORDER BY `subcategoryID` ASC
SELECT *
FROM `category`
ORDER BY `categoryID` ASC